results/rest/stage-150/payload-small/1000VUs/repeat-1/1000vus-summary.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./src/rest/restTest.js
        output: json (./results/rest/stage-150/payload-small/1000VUs/repeat-1/1000vus.json)

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 1000 looping VUs for 1m0s (gracefulStop: 30s)


running (0m00.9s), 1000/1000 VUs, 108 complete and 0 interrupted iterations
default   [   2% ] 1000 VUs  0m00.9s/1m0s

running (0m01.9s), 1000/1000 VUs, 792 complete and 0 interrupted iterations
default   [   3% ] 1000 VUs  0m01.9s/1m0s

running (0m02.9s), 1000/1000 VUs, 1632 complete and 0 interrupted iterations
default   [   5% ] 1000 VUs  0m02.9s/1m0s

running (0m03.9s), 1000/1000 VUs, 2301 complete and 0 interrupted iterations
default   [   7% ] 1000 VUs  0m03.9s/1m0s

running (0m04.9s), 1000/1000 VUs, 3010 complete and 0 interrupted iterations
default   [   8% ] 1000 VUs  0m04.9s/1m0s

running (0m05.9s), 1000/1000 VUs, 3827 complete and 0 interrupted iterations
default   [  10% ] 1000 VUs  0m05.9s/1m0s

running (0m06.9s), 1000/1000 VUs, 4536 complete and 0 interrupted iterations
default   [  12% ] 1000 VUs  0m06.9s/1m0s

running (0m07.9s), 1000/1000 VUs, 5227 complete and 0 interrupted iterations
default   [  13% ] 1000 VUs  0m07.9s/1m0s

running (0m08.9s), 1000/1000 VUs, 6050 complete and 0 interrupted iterations
default   [  15% ] 1000 VUs  0m08.9s/1m0s

running (0m09.9s), 1000/1000 VUs, 6756 complete and 0 interrupted iterations
default   [  17% ] 1000 VUs  0m09.9s/1m0s

running (0m10.9s), 1000/1000 VUs, 7482 complete and 0 interrupted iterations
default   [  18% ] 1000 VUs  0m10.9s/1m0s

running (0m11.9s), 1000/1000 VUs, 8182 complete and 0 interrupted iterations
default   [  20% ] 1000 VUs  0m11.9s/1m0s

running (0m12.9s), 1000/1000 VUs, 8949 complete and 0 interrupted iterations
default   [  22% ] 1000 VUs  0m12.9s/1m0s

running (0m13.9s), 1000/1000 VUs, 9737 complete and 0 interrupted iterations
default   [  23% ] 1000 VUs  0m13.9s/1m0s

running (0m14.9s), 1000/1000 VUs, 10448 complete and 0 interrupted iterations
default   [  25% ] 1000 VUs  0m14.9s/1m0s

running (0m15.9s), 1000/1000 VUs, 11184 complete and 0 interrupted iterations
default   [  27% ] 1000 VUs  0m15.9s/1m0s

running (0m16.9s), 1000/1000 VUs, 11903 complete and 0 interrupted iterations
default   [  28% ] 1000 VUs  0m16.9s/1m0s

running (0m16.1s), 1000/1000 VUs, 12620 complete and 0 interrupted iterations
default   [  30% ] 1000 VUs  0m17.9s/1m0s

running (0m17.1s), 1000/1000 VUs, 13347 complete and 0 interrupted iterations
default   [  32% ] 1000 VUs  0m18.9s/1m0s

running (0m18.1s), 1000/1000 VUs, 14107 complete and 0 interrupted iterations
default   [  33% ] 1000 VUs  0m19.9s/1m0s

running (0m19.1s), 1000/1000 VUs, 14869 complete and 0 interrupted iterations
default   [  35% ] 1000 VUs  0m20.9s/1m0s

running (0m20.1s), 1000/1000 VUs, 15595 complete and 0 interrupted iterations
default   [  37% ] 1000 VUs  0m21.9s/1m0s

running (0m21.1s), 1000/1000 VUs, 16323 complete and 0 interrupted iterations
default   [  38% ] 1000 VUs  0m22.9s/1m0s

running (0m22.1s), 1000/1000 VUs, 17041 complete and 0 interrupted iterations
default   [  40% ] 1000 VUs  0m23.9s/1m0s

running (0m23.1s), 1000/1000 VUs, 17771 complete and 0 interrupted iterations
default   [  42% ] 1000 VUs  0m24.9s/1m0s

running (0m24.1s), 1000/1000 VUs, 18514 complete and 0 interrupted iterations
default   [  43% ] 1000 VUs  0m25.9s/1m0s

running (0m25.1s), 1000/1000 VUs, 19265 complete and 0 interrupted iterations
default   [  45% ] 1000 VUs  0m26.9s/1m0s

running (0m26.1s), 1000/1000 VUs, 19990 complete and 0 interrupted iterations
default   [  47% ] 1000 VUs  0m27.9s/1m0s

running (0m27.1s), 1000/1000 VUs, 20736 complete and 0 interrupted iterations
default   [  48% ] 1000 VUs  0m28.9s/1m0s

running (0m28.1s), 1000/1000 VUs, 21481 complete and 0 interrupted iterations
default   [  50% ] 1000 VUs  0m29.9s/1m0s

running (0m29.1s), 1000/1000 VUs, 22228 complete and 0 interrupted iterations
default   [  52% ] 1000 VUs  0m30.9s/1m0s

running (0m30.1s), 1000/1000 VUs, 22968 complete and 0 interrupted iterations
default   [  53% ] 1000 VUs  0m31.9s/1m0s

running (0m31.1s), 1000/1000 VUs, 23724 complete and 0 interrupted iterations
default   [  55% ] 1000 VUs  0m32.9s/1m0s

running (0m32.1s), 1000/1000 VUs, 24448 complete and 0 interrupted iterations
default   [  57% ] 1000 VUs  0m33.9s/1m0s

running (0m33.1s), 1000/1000 VUs, 25177 complete and 0 interrupted iterations
default   [  58% ] 1000 VUs  0m34.9s/1m0s

running (0m34.1s), 1000/1000 VUs, 25931 complete and 0 interrupted iterations
default   [  60% ] 1000 VUs  0m35.9s/1m0s

running (0m35.1s), 1000/1000 VUs, 26636 complete and 0 interrupted iterations
default   [  62% ] 1000 VUs  0m36.9s/1m0s

running (0m36.1s), 1000/1000 VUs, 27277 complete and 0 interrupted iterations
default   [  63% ] 1000 VUs  0m37.9s/1m0s

running (0m37.1s), 1000/1000 VUs, 28033 complete and 0 interrupted iterations
default   [  65% ] 1000 VUs  0m38.9s/1m0s

running (0m38.1s), 1000/1000 VUs, 28768 complete and 0 interrupted iterations
default   [  67% ] 1000 VUs  0m39.9s/1m0s

running (0m39.1s), 1000/1000 VUs, 29552 complete and 0 interrupted iterations
default   [  68% ] 1000 VUs  0m40.9s/1m0s

running (0m40.1s), 1000/1000 VUs, 30325 complete and 0 interrupted iterations
default   [  70% ] 1000 VUs  0m41.9s/1m0s

running (0m41.1s), 1000/1000 VUs, 31123 complete and 0 interrupted iterations
default   [  72% ] 1000 VUs  0m42.9s/1m0s

running (0m42.1s), 1000/1000 VUs, 31816 complete and 0 interrupted iterations
default   [  73% ] 1000 VUs  0m43.9s/1m0s

running (0m43.1s), 1000/1000 VUs, 32509 complete and 0 interrupted iterations
default   [  75% ] 1000 VUs  0m44.9s/1m0s

running (0m44.1s), 1000/1000 VUs, 33179 complete and 0 interrupted iterations
default   [  77% ] 1000 VUs  0m45.9s/1m0s

running (0m45.1s), 1000/1000 VUs, 33993 complete and 0 interrupted iterations
default   [  78% ] 1000 VUs  0m46.9s/1m0s

running (0m44.3s), 1000/1000 VUs, 34826 complete and 0 interrupted iterations
default   [  80% ] 1000 VUs  0m47.9s/1m0s

running (0m45.3s), 1000/1000 VUs, 35449 complete and 0 interrupted iterations
default   [  82% ] 1000 VUs  0m48.9s/1m0s

running (0m46.3s), 1000/1000 VUs, 36128 complete and 0 interrupted iterations
default   [  83% ] 1000 VUs  0m49.9s/1m0s

running (0m47.3s), 1000/1000 VUs, 36942 complete and 0 interrupted iterations
default   [  85% ] 1000 VUs  0m50.9s/1m0s

running (0m48.3s), 1000/1000 VUs, 37734 complete and 0 interrupted iterations
default   [  87% ] 1000 VUs  0m51.9s/1m0s

running (0m49.3s), 1000/1000 VUs, 38371 complete and 0 interrupted iterations
default   [  88% ] 1000 VUs  0m52.9s/1m0s

running (0m50.3s), 1000/1000 VUs, 39076 complete and 0 interrupted iterations
default   [  90% ] 1000 VUs  0m53.9s/1m0s

running (0m51.3s), 1000/1000 VUs, 39942 complete and 0 interrupted iterations
default   [  92% ] 1000 VUs  0m54.9s/1m0s

running (0m52.3s), 1000/1000 VUs, 40645 complete and 0 interrupted iterations
default   [  93% ] 1000 VUs  0m55.9s/1m0s

running (0m53.3s), 1000/1000 VUs, 41292 complete and 0 interrupted iterations
default   [  95% ] 1000 VUs  0m56.9s/1m0s

running (0m54.3s), 1000/1000 VUs, 42155 complete and 0 interrupted iterations
default   [  97% ] 1000 VUs  0m57.9s/1m0s

running (0m55.3s), 1000/1000 VUs, 42882 complete and 0 interrupted iterations
default   [  98% ] 1000 VUs  0m58.9s/1m0s

running (0m56.3s), 1000/1000 VUs, 43508 complete and 0 interrupted iterations
default   [ 100% ] 1000 VUs  0m59.9s/1m0s


  █ TOTAL RESULTS 

    CUSTOM
    benchmark_slow_failure_rate....: 46.94% 20917 out of 44553
    benchmark_total_failure_rate...: 46.94% 20917 out of 44553

    HTTP
    http_req_duration..............: avg=1.29s min=20.49µs  med=990.87ms max=56.31s p(90)=1.18s p(95)=1.21s
      { expected_response:true }...: avg=1.16s min=20.49µs  med=990.53ms max=56.12s p(90)=1.18s p(95)=1.2s 
    http_req_failed................: 0.22%  99 out of 44553
    http_reqs......................: 44553  781.827045/s

    EXECUTION
    iteration_duration.............: avg=1.35s min=401.51ms med=997.08ms max=1m0s   p(90)=1.18s p(95)=1.21s
    iterations.....................: 44553  781.827045/s
    vus............................: 1000   min=1000           max=1000
    vus_max........................: 1000   min=1000           max=1000

    NETWORK
    data_received..................: 11 MB  194 kB/s
    data_sent......................: 6.9 MB 122 kB/s



running (0m57.0s), 0000/1000 VUs, 44553 complete and 0 interrupted iterations
default ✓ [ 100% ] 1000 VUs  1m0s